#### SolidCurveIntersectionOptions Members

---

|  |
| --- |
| SolidCurveIntersectionOptions Class   Constructors   Methods   Properties   See Also |

The  SolidCurveIntersectionOptions  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | SolidCurveIntersectionOptions | Constructs a new SolidCurveIntersectionMode with default settings. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  SolidCurveIntersectionOptions |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | ResultType | The type of results expected by the calculation. The default is CurveSegmentsInside. |

# See Also

SolidCurveIntersectionOptions Class

Autodesk.Revit.DB Namespace